## OpenTofu Plan: bootstrap-governance

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group.level1["decommissioned"] will be created
  + resource "azurerm_management_group" "level1" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-decommissioned"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level1["landingzone"] will be created
  + resource "azurerm_management_group" "level1" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-landingzone"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level1["platform"] will be created
  + resource "azurerm_management_group" "level1" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-platform"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level1["sandbox"] will be created
  + resource "azurerm_management_group" "level1" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-sandbox"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level2["connectivity"] will be created
  + resource "azurerm_management_group" "level2" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-connectivity"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level2["corp"] will be created
  + resource "azurerm_management_group" "level2" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-corp"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level2["identity"] will be created
  + resource "azurerm_management_group" "level2" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-identity"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level2["management"] will be created
  + resource "azurerm_management_group" "level2" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-management"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level2["online"] will be created
  + resource "azurerm_management_group" "level2" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-online"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.level2["security"] will be created
  + resource "azurerm_management_group" "level2" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-security"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group_subscription_association.all["connectivity_connectivity_nonprod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["connectivity_connectivity_prod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["corp_devops_nonprod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["corp_devops_prod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["corp_esb_nonprod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["corp_esb_prod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["identity_identity"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["management_management"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["online_edge_nonprod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["online_edge_prod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["security_security_nonprod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.all["security_security_prod"] will be created
  + resource "azurerm_management_group_subscription_association" "all" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (sensitive value)
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```
